Jcpaul1226/PIC18F-Microcontroller-code/Street_Light.c
    } 
}

void init_IO()
{
    TRISA = 0xFF;                                                                           //sets Port A to all inputs
    TRISB = 0x07;                                                                           //sets Port B's first 3 bits to inputs
    TRISC = 0x00;                                                                           //sets Port C to all outputs
    TRISD = 0x00;                                                                           //sets Port D to all outputs
    TRISE = 0x00;                                                                           //sets Port E to all outputs
}

void Init_ADC()
{
    ADCON0 = 0x01;
    ADCON1= 0x0E; 
    ADCON2= 0xA9;
}

unsigned int get_full_ADC()
{
unsigned int result;
   ADCON0bits.GO=1;                                                                         // Start Conversion
   while(ADCON0bits.DONE==1);                                                               // wait for conversion to be completed
   result = (ADRESH * 0x100) + ADRESL;                                                      // combine result of upper byte and
                                                                                            // lower byte into result
   return result;                                                                           // return the result.
}

void Set_NS(char color)
{
    direction = NS;                                                                         //sets direction to NS
    update_LCD_color(direction, color);                                                     //displays color corresponding to the loaded direction on TFT panel
    
    switch (color)
    {
        case OFF: NS_RED =0;NS_GREEN=0;break;                                               // Turns off the NS LED
        case RED: NS_RED =1;NS_GREEN=0;break;                                               // Sets NS LED RED
        case GREEN: NS_RED =0;NS_GREEN=1;break;                                             // sets NS LED GREEN
        case YELLOW: NS_RED =1;NS_GREEN=1;break;                                            // sets NS LED YELLOW
    }
}

void Set_NS_LT(char color)
{
    direction = NSLT;                                                                       //sets direction to NSLT
    update_LCD_color(direction, color);                                                     //displays color corresponding to the loaded direction on TFT panel
    
    switch (color)
    {
        case OFF: NSLT_RED =0;NSLT_GREEN=0;break;                                           // Turns off the NS LED
        case RED: NSLT_RED =1;NSLT_GREEN=0;break;                                           // Sets NSLT LED RED
        case GREEN: NSLT_RED =0;NSLT_GREEN=1;break;                                         // sets NSLT LED GREEN
        case YELLOW: NSLT_RED =1;NSLT_GREEN=1;break;                                        // sets NSLT LED YELLOW
    }
}

void Set_EW(char color)
{
    direction = EW;                                                                         //sets direction to EW
    update_LCD_color(direction, color);                                                     //displays color corresponding to the loaded direction on TFT panel
    
    switch (color)
    {
        case OFF: EW_RED =0;EW_GREEN=0;break;                                               // Turns off the EW LED
        case RED: EW_RED =1;EW_GREEN=0;break;                                               // Sets EW LED RED
        case GREEN: EW_RED =0;EW_GREEN=1;break;                                             // sets EW LED GREEN
        case YELLOW: EW_RED =1;EW_GREEN=1;break;                                            // sets EW LED YELLOW
    }
}

void Set_EW_LT(char color)
{
    direction = EWLT;                                                                       //sets direction to EWLT
    update_LCD_color(direction, color);                                                     //displays color corresponding to the loaded direction on TFT panel
    
    switch (color)
    {
        case OFF: EWLT_RED =0;EWLT_GREEN=0;break;                                           // Turns off the EWLT LED
        case RED: EWLT_RED =1;EWLT_GREEN=0;break;                                           // Sets EWLT LED RED
        case GREEN: EWLT_RED =0;EWLT_GREEN=1;break;                                         // sets EWLT LED GREEN
        case YELLOW: EWLT_RED =1;EWLT_GREEN=1;break;                                        // sets EWLT LED YELLOW
    }
}

void Activate_Buzzer()                                                                      //activates continuous buzz
{
    PR2 = 0b11111001;
    T2CON = 0b00000101;
    CCPR2L = 0b01001010;
    CCP2CON = 0b00111100;
}

void Deactivate_Buzzer()                                                                    //deactivates continuous buzz
{
    CCP2CON = 0x0;
    PORTBbits.RB3 = 0;
}

void PED_Control( char direction, char Num_Sec)
{ 
    for(char i = Num_Sec-1;i>0; i--)                                                        //counts down from loaded number
    {
        update_LCD_PED_Count(direction, i);                                                 //loads pedestrian's direction and wait time to TFT panel and
        Wait_One_Second_With_Beep();                                                        //displays seconds left on TFT panel with buzz
    }
    
    update_LCD_PED_Count(direction, 0);                                                     //loads TFT panel with 0
    Wait_One_Second_With_Beep();
}

void Day_Mode()
{
    MODE = 1;                                                                               // turns on the MODE_LED
    MODE_LED = 1;
    Act_Mode_Txt[0] = 'D';
    
    Set_NS_LT(RED);
    Set_EW(RED);
    Set_EW_LT(RED);
    Set_NS(GREEN);                                                                          //all lights red except NS green
    if (NS_PED_SW == 1)
    {
        PED_Control(0,7);                                                                   //calls PED_control in NS direction for 7 seconds if ped request is made
    }
    
    Wait_N_Seconds(9);
    
    Set_NS(YELLOW);                                                                         //turns NS yellow after 9 seconds
    Wait_N_Seconds(3);
    
    Set_NS(RED);                                                                            //turns NS red after 3 seconds
    
    if(EW_LT_SW == 1)
    {
        Set_EW_LT(GREEN);                                            
        Wait_N_Seconds(7);                                                                  //turns EWLT green for 7 seconds if EW left turn request is made
        
