Jcpaul1226/PIC18F-Microcontroller-code/Street_Light.c
        Set_EW_LT(YELLOW);
        Wait_N_Seconds(3);                                                                  //turns EWLT yellow for 3 seconds
        
        Set_EW_LT(RED);                                                                     //turns EWLT red
    }
    
    Set_EW(GREEN);                                                                          //turns EW green
    
    if(EW_PED_SW == 1)
    {
        PED_Control(2,9);                                                                   //calls PED_control in EW direction for 9 seconds if ped request is made
    }
    
    Set_EW(GREEN);
    Wait_N_Seconds(8);                                                                      //turns EW green for 8 seconds
    
    Set_EW(YELLOW);
    Wait_N_Seconds(3);                                                                      //turns EW yellow for 3 seconds
    
    Set_EW(RED);                                                                            //turns EW red
    
    if(NS_LT_SW == 1)
    {
        Set_NS_LT(GREEN);
        Wait_N_Seconds(7);                                                                  //turns NSLT green for 7 seconds if NS left turn request is made
        
        Set_NS_LT(YELLOW);
        Wait_N_Seconds(3);                                                                  //turns NSLT yellow for 3 seconds
        
        Set_NS_LT(RED);                                                                     //turns NSLT red        
    }
}
void Night_Mode()
{ 
    MODE = 0;                                                                               // turns off the MODE_LED
    MODE_LED = 0;
    Act_Mode_Txt[0] = 'N';
    
    Set_NS_LT(RED);
    Set_EW(RED);
    Set_EW_LT(RED);
    Set_NS(GREEN);
    Wait_N_Seconds(9);                                                                      //all lights red except NS green for 9 seconds
    
    Set_NS(YELLOW);
    Wait_N_Seconds(3);                                                                      //turns NS yellow after 3 seconds
    
    Set_NS(RED);                                                                            //turns NS red after 3 seconds
    
    if(EW_LT_SW == 1)
    {
        Set_EW_LT(GREEN);                                            
        Wait_N_Seconds(7);                                                                  //turns EWLT green for 7 seconds if EW left turn request is made
        
        Set_EW_LT(YELLOW);
        Wait_N_Seconds(3);                                                                  //turns EWLT yellow for 3 seconds
        
        Set_EW_LT(RED);                                                                     //turns EWLT red
    }
    
    Set_EW(GREEN);
    Wait_N_Seconds(8);                                                                      //turns EW green for 8 seconds
    
    Set_EW(YELLOW);
    Wait_N_Seconds(3);                                                                      //turns EW yellow for 3 seconds
    
    Set_EW(RED);                                                                            //turns EW red
    
    if(NS_LT_SW == 1)
    {
        Set_NS_LT(GREEN);
        Wait_N_Seconds(7);                                                                  //turns NSLT green for 7 seconds if NS left turn request is made
        
        Set_NS_LT(YELLOW);
        Wait_N_Seconds(3);                                                                  //turns NSLT yellow for 3 seconds
        
        Set_NS_LT(RED);                                                                     //turns NSLT red
    }

}

//void Old_Wait_One_Second()                                                                //creates one second delay and blinking asterisk
//{
//    SEC_LED = 1;
//    Wait_Half_Second();                                                                   // Wait for half second (or 500 msec)
//    SEC_LED = 0;
//    Wait_Half_Second();                                                                   // Wait for half second (or 500 msec)
//
//}

void Wait_One_Second()                                                                      // creates one second delay and blinking asterisk
{
    SEC_LED = 1;
    strcpy(txt,"*");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Wait_Half_Second();                                                                     // Wait for half second (or 500 msec)

    SEC_LED = 0;
    strcpy(txt," ");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Wait_Half_Second();                                                                     // Wait for half second (or 500 msec)
    update_LCD_misc();
}

void Wait_One_Second_With_Beep()                                                            // creates one second delay as well as sound buzzer
{
    SEC_LED = 1;
    strcpy(txt,"*");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Activate_Buzzer();                                                                      //activates buzzer
    Wait_Half_Second();                                                                     // Wait for half second (or 500 msec)

    SEC_LED = 0;
    strcpy(txt," ");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Deactivate_Buzzer();                                                                    //deactivates buzzer
    Wait_Half_Second();                                                                     // Wait for half second (or 500 msec)
    update_LCD_misc();
}
    
void Wait_Half_Second()
{
    T0CON = 0x03;                                                                           // Timer 0, 16-bit mode, prescaler 1:16
    TMR0L = 0xDB;                                                                           // set the lower byte of TMR
    TMR0H = 0x0B;                                                                           // set the upper byte of TMR
    INTCONbits.TMR0IF = 0;                                                                  // clear the Timer 0 flag
    T0CONbits.TMR0ON = 1;                                                                   // Turn on the Timer 0
    while (INTCONbits.TMR0IF == 0);                                                         // wait for the Timer Flag to be 1 for done
    T0CONbits.TMR0ON = 0;                                                                   // turn off the Timer 0
}

void Wait_N_Seconds (char seconds)
{
    char I;
    for (I = seconds; I> 0; I--)
    {
        update_LCD_count(direction, I);                                                     //loads direction and wait time left on corresponding light to TFT panel
        Wait_One_Second();                                                                  //and displays seconds left     
    }
    update_LCD_count(direction, 0);                                                         //loads TFT panel with 0
}

void update_LCD_color(char direction, char color)
{
    char Circle_Y;
    Circle_Y = NS_Cir_Y + direction * 30;    
    
    if (color == Color_Off)                                                                 //if Color off make all circles black but leave outline
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);                       
    }    
    
    if (color == Color_Red)                                                                 //if the color is red only fill the red circle with red
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
          
    if (color == Color_Green)                                                               //if the color is green only fill the green circle with green
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
    
    if (color == Color_Yellow)                                                              //if the color is yellow only fill the yellow circle with yellow
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
}

void update_LCD_count(char direction, char count)
{
   switch (direction)                       
   {
        case NS:       
        NS_Count[0] = count/10  + '0';
        NS_Count[1] = count%10  + '0';
        drawtext(XCNT, NS_Count_Y, NS_Count, NS_Color, ST7735_BLACK, TS_2); 
        break;
      
        case NSLT:       
        NSLT_Count[0] = count/10  + '0';
        NSLT_Count[1] = count%10  + '0';
        drawtext(XCNT, NSLT_Count_Y, NSLT_Count, NSLT_Color, ST7735_BLACK, TS_2); 
        break;
    
        case EW:       
        EW_Count[0] = count/10  + '0';
        EW_Count[1] = count%10  + '0';
        drawtext(XCNT, EW_Count_Y, EW_Count, EW_Color, ST7735_BLACK, TS_2); 
        break;
        
        case EWLT:       
        EWLT_Count[0] = count/10  + '0';
        EWLT_Count[1] = count%10  + '0';
        drawtext(XCNT, EWLT_Count_Y, EWLT_Count, EWLT_Color, ST7735_BLACK, TS_2); 
        break;
    }  
}

void update_LCD_PED_Count(char direction, char count)
{

   switch (direction)
   {
        case NS:       
        PED_NS_Count[0] = count/10  + '0';                                                  // PED count upper digit
        PED_NS_Count[1] = count%10  + '0';                                                  // PED Lower
        drawtext(PED_Count_X, PED_NS_Count_Y, PED_NS_Count, NS_Color, ST7735_BLACK, TS_2);  // Put counter digit on screen
        break;
      
        case EW:       
        PED_EW_Count[0] = count/10  + '0';                                                  // PED count upper digit
        PED_EW_Count[1] = count%10  + '0';                                                  // PED Lower
        drawtext(PED_Count_X, PED_EW_Count_Y, PED_EW_Count, EW_Color, ST7735_BLACK, TS_2);  // Put counter digit on screen
        break;

